<p>&iexcl;Hola de nuevo! Antes de empezar, ten en cuenta de que esto es una especie de continuaci&oacute;n a mi anterior blog: "Cosas que hubiera deseado saber antes de aprender a programar"</p>
<p>No es necesario que vayas hasta all&aacute; a leerlo, pero puede que te d&eacute; un mejor contexto de lo que voy a hablar. Sin m&aacute;s, comencemos.</p>
<p>Quiz&aacute; te preguntes: Miguel, &iquest;c&oacute;mo le hiciste para iniciarte en este mundo de la programaci&oacute;n? Ven que te cuento un poco, as&iacute; que prepara algo para tomar, as&iacute; sea ag&uuml;ita y lee atentamente. O quiz&aacute; no tanto, puedes tener TikTok a la mano y scrollear mientras lees si tienes la mente podrida por las redes como yo, jaja.</p>
<p></p>
<p>En mi entrada anterior hablaba de todas esas cosas que me hubiera gustado saber antes de programar. Hoy quiero contarles <em data-start="1756" data-end="1762">c&oacute;mo</em> fue que empec&eacute; realmente, y c&oacute;mo esa aventura me llev&oacute; de un simple curso online hasta crear juegos con mi propio estilo.</p>
<p></p>
<p>Despu&eacute;s de que tuve esa aclamada charla con el tipazo que era Jairo (y creo que a&uacute;n sigue siendo, solo que no he hablado con &eacute;l desde hace un buen tiempo) me decant&eacute; por la programaci&oacute;n, aunque eso quiz&aacute; ya lo sab&iacute;as.&nbsp;</p>
<p></p>
<p>Lo realmente jugoso viene cuando tom&eacute; el camino de aprendizaje. Cuando reci&eacute;n empec&eacute; en este mundo, me met&iacute; a Cisco, a&uacute;n en una versi&oacute;n algo temprana de sus cursos solo hab&iacute;a Python y C++ sin m&aacute;s. As&iacute; que por obvias razones escog&iacute; a Python para comenzar.</p>
<p></p>
<p>Python es como ese amigo buena onda que cae muy bien al conocer, y que todos subestiman. Lo toman como un apoyo o un bast&oacute;n pero lo sueltan en cuanto aprenden algo. Y eso no est&aacute; mal, no hay que casarse con ning&uacute;n lenguaje de programaci&oacute;n despu&eacute;s de todo.</p>
<p>Cuando termin&eacute; de aprender Python gracias a Cisco (ojo, no es publicidad. Aunque deber&iacute;as pasarte a hacer un curso si quieres, es gratis y tienen buena forma de ense&ntilde;ar). Pens&eacute;: &iquest;Y ahora qu&eacute;?</p>
<p></p>
<p>Si llegaste hasta ac&aacute; seguramente te vas a esperar algo como: Me lanc&eacute; un juego en Roblox e hice millones y luego me hice famos&iacute;simo en Youtube, Facebook y Tiktok en donde acumulo miles de seguidores, ten, compra este curso.</p>
<p></p>
<p>Pero no, la verdad es que no es as&iacute;. Tuve un tiempo de "oscuridad" por as&iacute; decirlo. Despu&eacute;s de terminar con Python no volv&iacute; a tocar el mundo de la programaci&oacute;n por al menos unos 6-7 meses. Bastante tiempo la verdad.</p>
<p>Y ojo, no es que diga que te va a pasar. Pero si te llega a suceder no te preocupes. No vas a olvidar todo, no vas a perder la chispa, no va a terminar todo ah&iacute;. Y en caso de que llegara a suceder, siempre se puede volver a iniciar. No es el fin del mundo, ni de t&iacute;.</p>
<p></p>
<p>Para ser sincero, ni pensaba volver. Fue un d&iacute;a en el que estaba jugando con mi sobrino a un jueguito peque&ntilde;o de Roblox. A ver si adivinas: Iba de escapar de monstruos en un hotel. Siempre me atrapaba el tipo que apagaba las luces y ven&iacute;a haciendo un sonido chirriante...</p>
<p></p>
<p>Al ver el gran esfuerzo y m&eacute;rito que ten&iacute;a ese juego, se me vino una idea flash... Yo tambi&eacute;n podr&iacute;a hacer algo as&iacute;, &iquest;no?</p>
<p></p>
<p>Al inicio la verdad es que volv&iacute; a Python: No ten&iacute;a ni la menor idea de lo que era un motor de videojuegos o con qu&eacute; se com&iacute;a. Intent&eacute; hacer con tkinter un tamagotchi, que por cierto es Lost Media. Era tan horrible que no pod&iacute;a permitirle vivir jajaja. Era un PowerPoint de im&aacute;genes literalmente.</p>
<p></p>
<p>Al ver que Python no daba para eso, me fui a donde el amigazo GPT y le pregunt&eacute; sobre motores de videojuegos. Me solt&oacute; varios y al principio escog&iacute; GameMaker 2 porque dije: Bueno, al parecer Toby Fox se hizo Undertale con esto, quiz&aacute; yo tambi&eacute;n.</p>
<p></p>
<p>No me gust&oacute; en absoluto, as&iacute; que pas&eacute; a la siguiente opci&oacute;n: Roblox Studio.</p>
<p></p>
<p>No te mentir&eacute;: Fue un desastre total. As&iacute; es siempre que comenzamos, es como cuando un chef intenta una receta por primera vez. Se quemar&aacute; las pesta&ntilde;as hasta lograrlo con &eacute;xito. Mi primer juego se llamaba "Space Obby"</p>
<p></p>
<p>...No abr&iacute;a ni siquiera. Literal crasheaba cuando lo lanc&eacute; desde mi PC y la consola de mi sobrino jaja... Qu&eacute; buenos tiempos.</p>
<p></p>
<p>Me dije a m&iacute; mismo: Los Obby no son lo m&iacute;o, &iquest;y si voy a un plataformero?</p>
<p>Hice un peque&ntilde;o prototipo de juego llamado "Baller n' Ball Adventures". Se mov&iacute;a m&aacute;s que el anterior pero no... Jugar con una pelota en un entorno 3D era agobiante. Saltar a una plataforma y que la pelota se chocara con una esquinita y saliera volando... Ni yo lo aguantaba.</p>
<p></p>
<p>Pas&eacute; al &uacute;ltimo juego que hice en Roblox y ese s&iacute; vi&oacute; la luz del d&iacute;a: "The Dead CyberSpace"</p>
<p>Una historia con muchos huecos, modelos nefastos y rendimiento mediocre. Pero le tengo cari&ntilde;o, porque es algo a lo que yo le d&iacute; vida con horas y horas de sudor, testear y pensar en que no habr&iacute;a un ma&ntilde;ana...</p>
<p></p>
<p>Cuando lo lanc&eacute; estaba super nervioso de que alguien lo probara. Pero nadie lleg&oacute;. Y cuando haces algo no todos tienen que verlo siempre. Puede que sea una basura o una obra de arte, pero solo t&uacute; sabes el esfuerzo y dedicaci&oacute;n que hay detr&aacute;s de ese proyecto. No te sientas mal si tambi&eacute;n te pas&oacute; o te sigue pasando, que es natural entre los miles de millones de humanos que programan d&iacute;a a d&iacute;a.</p>
<p></p>
<p>Luego de eso tuve un periodo de no hacer nada de varios meses y a mi vida lleg&oacute; &eacute;l... Hermoso, especial, manejable... &iquest;Pensaste que mencionar&iacute;a a una persona?&nbsp;</p>
<p>&iexcl;No! Se trata de Godot. Ah&iacute; hice mi primer juego, luego el segundo y el tercero. Son juegos peque&ntilde;os, nadie los juega, pero yo s&eacute; el esfuerzo que puse sobre cada uno, as&iacute; como la historia y di&aacute;logos con emociones que quise transmitir.</p>
<p></p>
<p>La verdad es que si quer&iacute;as ver una historia de &eacute;xito... Llegaste y a la vez no al lugar indicado. El &eacute;xito no siempre es fama, seguidores y dinero. A veces el &eacute;xito es terminar un d&iacute;a y empezar otro. Corregir un bug y encontrar dos. Abrir el motor, el int&eacute;rprete o lo que uses y ver el c&oacute;digo de ayer para luego cerrarlo todo de nuevo.</p>
<p>&iquest;Ves? El &eacute;xito es muy variable entre persona y persona. As&iacute; que no te agobies tanto por tus proyectos. No tienes que hacer un Minecraft 2 de la noche a la ma&ntilde;ana, o crear la secuela de la Rueda, porque son cosas que ya funcionan y existen. S&eacute; original, no sigas la corriente siempre, porque aunque quiz&aacute; te d&eacute; fama, la verdad es que luego te desgasta.</p>
<p></p>
<p>Y con ese consejo puedo decir que doy por terminado este blog. Empec&eacute; hablando de aprender y luego de c&oacute;mo entr&eacute; al mundo de los juegos jajaja. Pero as&iacute; es mi forma de hablar a veces.</p>
<p>Ahora s&iacute; sin m&aacute;s, gracias por leer, estimado t&uacute;. Gracias por pasarte por aqu&iacute; y ver un poco acerca de m&iacute;. Espero tambi&eacute;n te lleves alguna reflexi&oacute;n o risita, &iexcl;nos vemos!</p>
<p></p>
<p></p>